In [124]:
import pyspark

print("pyspark is working")

pyspark is working

In [125]:
import pandas as pd

pd.read_csv('../together.csv')

       name      age  roll_no  marks
0     rohit    322.0        1     90
1    rutuja   4521.0        2    499
2   rajveer    314.0      343   1300
3     suraj  32420.0       64    490
4     aldsj      NaN       25   4433
5       NaN      NaN       66     89
6     rohit   2322.0       21     90
7    rutuja  23421.0      242   3499
8   rajveer   3414.0       33    100
9     suraj    463.0       34     90
10    aldsj      NaN        5     33
11      NaN      NaN       44     23

# PYSPARK SESSION

In [126]:
from pyspark.sql import SparkSession

In [127]:
# CREATE A SPARK SESSION

spark = SparkSession.builder.appName('Practice').getOrCreate()

print("Session created")

In [128]:
# GET THE SPARK OBJECT INFORMATION

spark

# OPERATIONS ON DATAFRAME

In [129]:
# MAKE A DATAFRAME OF A CSV FILE

df_pyspark = spark.read.csv('../together.csv')

df_pyspark.show()

+-------+-----+-------+-----+
|    _c0|  _c1|    _c2|  _c3|
+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  aldsj| null|     25| 4433|
|   null| null|     66|   89|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
|  aldsj| null|      5|   33|
|   null| null|     44|   23|
+-------+-----+-------+-----+

In [130]:
# CREATING NEW DATAFRAME THAT CAN SHOW PROPER HEADING
# inferSchema=True will give all the table headings respective datatype, otherwise will assign everything as string datatype

dataframe = spark.read.option('header','true').csv('../together.csv', inferSchema=True)

dataframe.show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  aldsj| null|     25| 4433|
|   null| null|     66|   89|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
|  aldsj| null|      5|   33|
|   null| null|     44|   23|
+-------+-----+-------+-----+

In [131]:
# GET TYPE OF THE DATAFRAME

type(dataframe)

pyspark.sql.dataframe.DataFrame

In [132]:
# GET THE FIRST N ELEMENTS FROM THE DATAFRAME

dataframe.head(3)

[Row(name='rohit', age=322, roll_no=1, marks=90),
 Row(name='rutuja', age=4521, roll_no=2, marks=499),
 Row(name='rajveer', age=314, roll_no=343, marks=1300)]

In [133]:
# GET THE SCHEMA OF THE DATAFRAME

dataframe.printSchema()

root
 |-- name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- roll_no: integer (nullable = true)
 |-- marks: integer (nullable = true)

In [134]:
 # ANOTHER TYPE TO READ THE CSV FILE
    
dataframe = spark.read.csv('../together.csv', header=True, inferSchema=True)

dataframe.show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  aldsj| null|     25| 4433|
|   null| null|     66|   89|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
|  aldsj| null|      5|   33|
|   null| null|     44|   23|
+-------+-----+-------+-----+

In [135]:
# GET THE COLUMN NAMES

dataframe.columns

['name', 'age', 'roll_no', 'marks']

In [136]:
# GET PERTICULAR COLUMN

dataframe.select('name').show()

+-------+
|   name|
+-------+
|  rohit|
| rutuja|
|rajveer|
|  suraj|
|  aldsj|
|   null|
|  rohit|
| rutuja|
|rajveer|
|  suraj|
|  aldsj|
|   null|
+-------+

In [137]:
# GET MULTIPLE COLUMNS

dataframe.select(['name', 'age']).show()

+-------+-----+
|   name|  age|
+-------+-----+
|  rohit|  322|
| rutuja| 4521|
|rajveer|  314|
|  suraj|32420|
|  aldsj| null|
|   null| null|
|  rohit| 2322|
| rutuja|23421|
|rajveer| 3414|
|  suraj|  463|
|  aldsj| null|
|   null| null|
+-------+-----+

In [138]:
# GET DATA TYPES OF COLUMNS

dataframe.dtypes

[('name', 'string'), ('age', 'int'), ('roll_no', 'int'), ('marks', 'int')]

In [139]:
# GET SHORT SUMMORY ABOUT DATAFRAME

dataframe.describe().show()

+-------+-----+-----------------+------------------+-----------------+
|summary| name|              age|           roll_no|            marks|
+-------+-----+-----------------+------------------+-----------------+
|  count|   10|                8|                12|               12|
|   mean| null|         8399.625| 73.33333333333333|894.6666666666666|
| stddev| null|12381.28316610543|106.77447203703646|1492.779246502268|
|    min|aldsj|              314|                 1|               23|
|    max|suraj|            32420|               343|             4433|
+-------+-----+-----------------+------------------+-----------------+

In [140]:
# ADDING NEW COLUMNS

new_dataframe = dataframe.withColumn('Age after 4 years', dataframe['age']+4)

new_dataframe.show()

+-------+-----+-------+-----+-----------------+
|   name|  age|roll_no|marks|Age after 4 years|
+-------+-----+-------+-----+-----------------+
|  rohit|  322|      1|   90|              326|
| rutuja| 4521|      2|  499|             4525|
|rajveer|  314|    343| 1300|              318|
|  suraj|32420|     64|  490|            32424|
|  aldsj| null|     25| 4433|             null|
|   null| null|     66|   89|             null|
|  rohit| 2322|     21|   90|             2326|
| rutuja|23421|    242| 3499|            23425|
|rajveer| 3414|     33|  100|             3418|
|  suraj|  463|     34|   90|              467|
|  aldsj| null|      5|   33|             null|
|   null| null|     44|   23|             null|
+-------+-----+-------+-----+-----------------+

In [141]:
# DROPPING COLUMNS

new_dataframe = new_dataframe.drop('Age after 4 years')

new_dataframe.show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  aldsj| null|     25| 4433|
|   null| null|     66|   89|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
|  aldsj| null|      5|   33|
|   null| null|     44|   23|
+-------+-----+-------+-----+

In [142]:
# RENAME A PARTICULAR COLUMN

new_dataframe.withColumnRenamed('name', 'New Name').show()

+--------+-----+-------+-----+
|New Name|  age|roll_no|marks|
+--------+-----+-------+-----+
|   rohit|  322|      1|   90|
|  rutuja| 4521|      2|  499|
| rajveer|  314|    343| 1300|
|   suraj|32420|     64|  490|
|   aldsj| null|     25| 4433|
|    null| null|     66|   89|
|   rohit| 2322|     21|   90|
|  rutuja|23421|    242| 3499|
| rajveer| 3414|     33|  100|
|   suraj|  463|     34|   90|
|   aldsj| null|      5|   33|
|    null| null|     44|   23|
+--------+-----+-------+-----+

# DROPPING TABLES, ROWS WITH NULL VALUES

In [143]:
# DROP THE PERTICULAR ROWS HAVING NULL VALUE

new_dataframe = new_dataframe.na.drop()

new_dataframe.show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [144]:
# DROPPING THE PARTICULAR TABLES WITH any==how

# IT WILL DELETE ROW WITH ALL COLUMN HAVING NULL VALUE

new_dataframe.na.drop(how="all").show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [145]:
# THRESH => ATLEAST THAT MANY VALUES ARE NOT NULL

new_dataframe.na.drop(how="any", thresh=3).show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [146]:
# subset => DROP VALUES FOR A PERTICULAR COLUMN HAVING NULL VALUES

new_dataframe.na.drop(how='any', subset=['age']).show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [147]:
# FILLING THE NULL VALUES / MISSING VALUES

# new_dataframe.na.fill(22, 'age').show()
new_dataframe.na.fill('xyz', ['name','age']).show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [148]:
df = new_dataframe.na.drop()
df.show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

# FILTERING OPERATION

In [149]:
# FILTER OPERATION

df.filter("age>20").show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [150]:
# SELECT PERTICULAR COLUMNS AFTER FILTERING

df.filter('age>20').select(['name', 'age']).show()

+-------+-----+
|   name|  age|
+-------+-----+
|  rohit|  322|
| rutuja| 4521|
|rajveer|  314|
|  suraj|32420|
|  rohit| 2322|
| rutuja|23421|
|rajveer| 3414|
|  suraj|  463|
+-------+-----+

In [151]:
df.filter(df['age']>20).show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
|  rohit|  322|      1|   90|
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
|  rohit| 2322|     21|   90|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
|  suraj|  463|     34|   90|
+-------+-----+-------+-----+

In [152]:
df.filter((df['age']>20) & (df['marks']>90)).show()

+-------+-----+-------+-----+
|   name|  age|roll_no|marks|
+-------+-----+-------+-----+
| rutuja| 4521|      2|  499|
|rajveer|  314|    343| 1300|
|  suraj|32420|     64|  490|
| rutuja|23421|    242| 3499|
|rajveer| 3414|     33|  100|
+-------+-----+-------+-----+

In [156]:
df.filter(~(df['age']>2000)).show()

+-------+---+-------+-----+
|   name|age|roll_no|marks|
+-------+---+-------+-----+
|  rohit|322|      1|   90|
|rajveer|314|    343| 1300|
|  suraj|463|     34|   90|
+-------+---+-------+-----+

# GROUP BY AND AGGREGATE FUNCTIONS

In [159]:
'''
min, max, sum, avg, mean, etc.
    
'''

df.groupBy('name').max().show()

+-------+--------+------------+----------+
|   name|max(age)|max(roll_no)|max(marks)|
+-------+--------+------------+----------+
|rajveer|    3414|         343|      1300|
|  rohit|    2322|          21|        90|
|  suraj|   32420|          64|       490|
| rutuja|   23421|         242|      3499|
+-------+--------+------------+----------+

In [157]:
df.groupBy('name').sum().show()

+-------+--------+------------+----------+
|   name|sum(age)|sum(roll_no)|sum(marks)|
+-------+--------+------------+----------+
|rajveer|    3728|         376|      1400|
|  rohit|    2644|          22|       180|
|  suraj|   32883|          98|       580|
| rutuja|   27942|         244|      3998|
+-------+--------+------------+----------+

In [158]:
df.groupBy('age').avg().show()

+-----+--------+------------+----------+
|  age|avg(age)|avg(roll_no)|avg(marks)|
+-----+--------+------------+----------+
|  463|   463.0|        34.0|      90.0|
|  322|   322.0|         1.0|      90.0|
|23421| 23421.0|       242.0|    3499.0|
| 2322|  2322.0|        21.0|      90.0|
| 4521|  4521.0|         2.0|     499.0|
|  314|   314.0|       343.0|    1300.0|
| 3414|  3414.0|        33.0|     100.0|
|32420| 32420.0|        64.0|     490.0|
+-----+--------+------------+----------+